SOLU/FAIR4RS/docker-container/testCase/singleDroplet/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     hybridFlashingFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          1E-3;

writeControl    adjustableRunTime;

writeInterval   0.1;

//writeControl    timeStep;
//
//writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  false;

maxCo           0.9;

maxDeltaT       1E-6;

CourantType	cellCourant;

libs
(
    "libadditionalThermophysicalProperties.so"
);

//OptimisationSwitches
//{
//    //- Parallel IO file handler
//    //  uncollated (default), collated or masterUncollated
//    fileHandler collated;
//}

functions
{
}


// ************************************************************************* //
